apps/contributions/tests/fixtures/payment-provider-data-monthly-contribution.json

{
  "account": "acct_1JhHQsPbhdfvD1kV",
  "api_version": "2020-08-27",
  "created": 1670912464,
  "data": {
    "object": {
      "amount": 36500,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 36500,
      "application": "ca_JGxDCnO08VRFiIKWUuBfOmOx70wFiBW0",
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "data": [
          {
            "amount": 36500,
            "amount_captured": 36500,
            "amount_refunded": 0,
            "application": "ca_JGxDCnO08VRFiIKWUuBfOmOx70wFiBW0",
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_3MERrPPbhdfvD1kV0tzPWzvW",
            "billing_details": {
              "address": {
                "city": "Wakeley",
                "country": "AU",
                "line1": "Townsville Road",
                "line2": "",
                "postal_code": "2176",
                "state": "New South Wales"
              },
              "email": "leo.alves+approved1111@fundjournalism.org",
              "name": "Leo Alves",
              "phone": "4444444"
            },
            "calculated_statement_descriptor": "WWW.WLRN.ORG",
            "captured": true,
            "created": 1670912464,
            "currency": "usd",
            "customer": "cus_My1o8pnlxAGNWe",
            "description": "Subscription update",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "id": "ch_3MERrPPbhdfvD1kV0dvBBR2s",
            "invoice": "in_1MERrPPbhdfvD1kVEPXp80Oq",
            "livemode": false,
            "metadata": {},
            "object": "charge",
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 21,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3MERrPPbhdfvD1kV0WhWonwA",
            "payment_method": "pm_1ME5lKPbhdfvD1kVIMcUueVQ",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": "pass",
                  "address_postal_code_check": "pass",
                  "cvc_check": null
                },
                "country": "US",
                "exp_month": 4,
                "exp_year": 2024,
                "fingerprint": "t3Nk1zg9IfbJoyRi",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "mandate": null,
                "network": "visa",
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xSmhIUXNQYmhkZnZEMWtWKNKz4JwGMgbzCwigNKw6LBajjE71OHUTCszJaoLwPJlQ-87B0YzBkelhcC78HY8j3AIw2GxgKsyqNJbW?s=ap",
            "refunded": false,
            "refunds": {
              "data": [],
              "has_more": false,
              "object": "list",
              "total_count": 0,
              "url": "/v1/charges/ch_3MERrPPbhdfvD1kV0dvBBR2s/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3MERrPPbhdfvD1kV0WhWonwA"
      },
      "client_secret": "pi_3MERrPPbhdfvD1kV0WhWonwA_secret_wtVNXR6HWjjd0p2wmudUsk9OA",
      "confirmation_method": "automatic",
      "created": 1670912463,
      "currency": "usd",
      "customer": "cus_My1o8pnlxAGNWe",
      "description": "Subscription update",
      "id": "pi_3MERrPPbhdfvD1kV0WhWonwA",
      "invoice": "in_1MERrPPbhdfvD1kVEPXp80Oq",
      "last_payment_error": null,
      "livemode": false,
      "metadata": {},
      "next_action": null,
      "object": "payment_intent",
      "on_behalf_of": null,
      "payment_method": "pm_1ME5lKPbhdfvD1kVIMcUueVQ",
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": ["card"],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "id": "evt_3MERrPPbhdfvD1kV09AdEqL2",
  "livemode": false,
  "object": "event",
  "pending_webhooks": 17,
  "request": {
    "id": "req_TGdjcF5m4oWN5C",
    "idempotency_key": "87a93bab-6b4d-4fcc-a4e8-fb28f7b86752"
  },
  "type": "payment_intent.succeeded"
}
